{
  "backend/main.mo": "Motoko actor defining Brand, LaptopModel, LaptopVariant, and ChatMessage types, with a pre-populated in-memory store of laptop brands (Apple, Dell, etc.) including nested model and variant data with image URL paths.",
  "feature_evidence.json": "Feature evidence report mapping three high-confidence features (app rebuild/redeploy, visual theme, and static image assets) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries for each frontend source file, describing the purpose and key implementation details of every component, page, hook, and utility in the project.",
  "frontend/index.css": "Empty CSS file serving as the frontend entry-level stylesheet.",
  "frontend/index.html": "Minimal HTML shell for the Rweb Infotech React app, mounting the app into a root div and loading the TypeScript entry point via a module script tag.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, Brands, Catalog, Products, LaptopDetail, About, Contact, and Chat pages, all wrapped in SiteLayout.",
  "frontend/src/components/brands/BrandTile.tsx": "Brand card component that displays a brand's image and model count inside a hoverable card, linking to the catalog page filtered by that brand.",
  "frontend/src/components/catalog/CatalogFiltersBar.tsx": "Filter bar component with a search input, brand select, RAM select, and a conditional clear button, accepting string arrays for brand and RAM options.",
  "frontend/src/components/catalog/LaptopCard.tsx": "Laptop catalog card component that displays a placeholder image, brand badge, model name, first variant specs (processor, RAM, storage), and a link to the laptop detail page.",
  "frontend/src/components/laptop/ImageGallery.tsx": "A React image gallery component with prev/next navigation, dot indicators, and thumbnails, using fallback placeholder images and error handling per image index.",
  "frontend/src/components/laptop/SpecsSections.tsx": "Displays laptop variant specifications (processor, RAM, storage, brand, model) grouped into labeled sections with icons.",
  "frontend/src/components/laptop/VariantSelector.tsx": "Renders a selectable list of laptop variants showing processor, RAM, and storage details, with visual highlighting for the currently selected variant.",
  "frontend/src/components/layout/SearchBar.tsx": "A search form component that navigates to the products page with a query parameter on submit, with a clear button to reset input.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site-wide footer with brand info, social media links, quick navigation links, and a UTM-tracked external referral link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky site header with logo, desktop search bar, navigation links with active-state styling, and a mobile hamburger menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Simple layout wrapper that composes SiteHeader, a main content area, and SiteFooter into a full-page flex column.",
  "frontend/src/components/state/AppErrorBoundary.tsx": "A React class-based error boundary that catches unhandled errors and displays a card UI with options to reload the page or navigate home.",
  "frontend/src/components/state/ErrorState.tsx": "Displays a centered error message with an optional retry button, deriving the message from a passed error object or string.",
  "frontend/src/components/state/LoadingState.tsx": "Renders skeleton placeholder layouts in either a grid or list variant to indicate loading state for laptop listings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching laptop brands, models, and variants from the backend actor, plus a mutation hook for chatting with the AI assistant.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for light/dark themes along with utility classes for gradients, card hover effects, and text styling.",
  "frontend/src/lib/assets/placeholders.ts": "Provides utility functions to return placeholder image URLs for laptops and brands, filtering invalid URLs and padding image arrays with placeholders as needed.",
  "frontend/src/lib/catalog/modelSummaries.ts": "Exports a helper function that extracts a concise processor, RAM, and storage summary from a LaptopVariant object.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "Static About Us page displaying company overview, core values, services, and team members for Rweb Infotech using card-based layout components.",
  "frontend/src/pages/BrandsPage.tsx": "Page that fetches and displays all laptop brands in a responsive grid using BrandTile components, with loading, error, and empty states handled.",
  "frontend/src/pages/CatalogPage.tsx": "Displays a filterable/searchable catalog of all laptop models fetched from the API, supporting filters by brand, RAM, and text search. Renders a grid of LaptopCard components with loading and error states.",
  "frontend/src/pages/ChatPage.tsx": "Implements an AI chat interface where users can send messages and receive responses from the Rweb AI Assistant. Manages message history, loading state, and keyboard input handling.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page displaying company contact information including CEO details, location, business hours, and links to Google Maps and the AI chat page.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section, stats bar, feature highlights, and a brands/models overview fetched from the API, with CTAs linking to the catalog and chat pages.",
  "frontend/src/pages/LaptopDetailPage.tsx": "Detail page for a specific laptop model identified by brand and model name URL params, showing an image gallery, variant selector, specs, and action buttons with loading/error handling.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a filterable, searchable catalog of all laptops by flattening brand/model data from the API. Supports filtering by search query, brand, and RAM with a clear-filters option.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (using CSS variables and oklch), fonts, border radii, shadows, and animations for the Rweb Infotech frontend.",
  "project_state.json": "Tracks the overall project state (version 13) for the Rweb Infotech laptop catalog website, including architectural notes, implemented features, known issues, and image requirements."
}